USE Lab_test;

-- Створення таблиці
CREATE TABLE CheckCurrencyTable (
    expression VARCHAR(50),
    result BIT
);

-- Вставлення правильних даних (з усіма дужками закритими)
INSERT INTO CheckCurrencyTable (expression, result) VALUES
    ('(5+3)*(9-4)', 1),
    ('((2+2)*3)-(5-2)', 1),
    ('(10/2)+(8/4)', 1),
    ('((6*2)-(4/2))', 1),
    ('(7+(3*2))/(5-1)', 1),
    ('((4*2)/2)-(6-1)', 1),
    ('(8+3)-(6*1)', 1),
    ('((9-3)+(4*1))', 1),
    ('((10/2)+3)', 1),
    ('((5*2)-(4/2))', 1);

-- Вставлення неправильних даних (де деякі дужки не закриті)
INSERT INTO CheckCurrencyTable (expression, result) VALUES
    ('(5+3)*(9-4', 0),
    ('((2+2*3-5-2)', 0),
    ('(10/2)+(8/4))', 0),
    ('(6*2)-(4/2))', 0),
    ('(7+(3*2))/(5-1', 0),
    ('((4*2)/2-6-1', 0),
    ('(8+3)-(6*1', 0),
    ('((9-3)+(4*1)', 0),
    ('((10/2)+3', 0),
    ('((5*2)-(4/2)', 0);


